print("Hello Chads") # String
print("GOA BEST!")
print("Hello World")

# ცვლადი არის მეხსიერებაში გამოყფილ ადგილას
# ჩაწერილი ინფორმაცია, რომელსაც ჩვენ მივანიჭბთ სახელს

# დავადეკლარირე ცვლადი სახელად toys რომელშიც შევინახე მნიშვნელობა 3
toys = 3 # integer
name = "Luka Gurgenidze" # string

print(2 + 3)
print("5" + "5")

"""
1) შექმენით 2 ცვლადი, ერთი იყოს რიცხვი (integer), მეორე იყოს ტექსტი (string) ეს 2 ცვლადი დაბეჭდეთ და ასევე დაბეჭდეთ 3 სიტყვა პირდაპირ ცვლადის შექმნის გარეშე მიწერეთ 1-2 კომენტარი თქვენი სიტყვებით ცვლადის შესახებ
"""

