"""
1) შექმენით 5 ცვლადი რომელშიც ჩამოწერეთ საქართველოს ქალქებს. დაბეჭედეე თითოეული 
ცლვადი. შემდეგ დაბეჭდეთ თითონ ცლვადის სახელი ბრჭყალებში. ახსენით რა 
გასნხვავებაა string-ის დაბეჭვდასა და ცვლადის სახელის დაბეჭდავს შორის 
კომენტარებით
"""

# city1 = "Gori"
# city2 = "Qareli"

# print(city1)
# print(city2)

# print("city1")
# print("city2")

# view

# word wrap

# პირველ შემთხვევაში გამოიტანა Gori რადგან ეს ინახებოდა ცვლადში city1
# ხოლო მეორე შემთხვევაში city1 ცვლადს კი არ წარმოადგენს, არამედ ტექტსი ci]ty1


# points = 35
# points = 45

# print(points)

# name = "Tom"
# level = 14
# print(name)
# level = level + 1
# print(level)

# points 7pts
# score

# "Just a sentence"

# aura = 2
# new_aura = aura + 5
# print(new_aura)

# aura = 10
# aura = 20

# პროგრამაში ხდება 2 ტიპის შეცდომა:
# 1. error - ეს არის ისეთი ტიპის შეცდომა რომელიც პროგრამის გაშვებას შეაფერხებს და ინტერპრეტატორი (რაც კოდს უშვებს) გვიჩვენებს რომელ ხაზზე შეწყდა კოდის გაშვება. პირველი error რომელ ხაზზეც აღმოჩნდება იმის იქით პროგრამა გაშვებას ვეღარ გააგრძლებს და მანდვე გაჩერდა. 
# 2. bug - გაუთვალისწინებელი შეთხვევა აღმოჩნდა რის გამოც კოდი არ გვაძლევს სასურველ შედეგს. კოდი რეალურად ეშვება შეუფერხებლად მაგრამ ვერ ვაღწევთ სასურველ მიზანს. ინტერპერატორი ასეთი ტიპის შეცომას ვერ გაითვალისწინებს

# print "5 + 3" ()

# color -> "red" არასწორი
# color = "red" სწორი

# salary = 50000
# role = Analyst
# age -> 29
# print(salary)

# salary = 70000
# print(salary) 
# age -> 32
# role = "Product Manager"
# print(role)

print(revenue)
revenue = 300